<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7e71af11473c20b32efed632b664de281aac892a9d1f69510bb13f7f658f9ebb","plan_job_ref":"Job Terraform plan #34 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132898375","plan_out_hash":"48605657a2bee73d7a3be1d96fee47ae79799417da9516aea83fea6de4550efe","plan_hash":"b8b96969aaf31d876a65c522de41fe33677d3e82eb0b2c66988b079e13223351","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                = "d4ef136o48bqjg3sv4q7"
        name              = "receive-video-handler"
        tags              = []
!~      user_hash         = "06aaaf655c660ea3f56b3ab3c0286f7b0228821e4325fadd00dd1dc50b2f9412" -> "d1ac35856cbd2a244d82c3f4144fccacead1c576d6e7eefd32a63edb18bb3b5f"
#        (10 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_message_queue.receive-video-handler-deadletter-queue will be created
+   resource "yandex_message_queue" "receive-video-handler-deadletter-queue" {
+       arn                         = (known after apply)
+       content_based_deduplication = false
+       delay_seconds               = 0
+       fifo_queue                  = false
+       id                          = (known after apply)
+       max_message_size            = 262144
+       message_retention_seconds   = 345600
+       name                        = "receive-video-handler-deadletter-queue"
+       receive_wait_time_seconds   = 0
+       region_id                   = "***********"
+       visibility_timeout_seconds  = 30
    }

  # yandex_message_queue.receive-video-handler-queue will be created
+   resource "yandex_message_queue" "receive-video-handler-queue" {
+       arn                         = (known after apply)
+       content_based_deduplication = false
+       delay_seconds               = 0
+       fifo_queue                  = false
+       id                          = (known after apply)
+       max_message_size            = 262144
+       message_retention_seconds   = 1209600
+       name                        = "receive-video-handler-queue"
+       receive_wait_time_seconds   = 0
+       redrive_policy              = (known after apply)
+       region_id                   = "***********"
+       visibility_timeout_seconds  = 10
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #19](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132905392)